# üçØüêùüçØüêùüçØüêùüçØüêùüçØüêùüçØüêùüçØüêùüçØüêùüçØüêùüçØüêù

Business Task:
Identify the honey bee population trend and how the following factors like Climate change, parasites and disease contributed to the trend

In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('save_the_bees.csv')
df

,state,state_code,num_colonies,max_colonies,lost_colonies,percent_lost,added_colonies,renovated_colonies,percent_renovated,quarter,year,varroa_mites,other_pests_and_parasites,diseases,pesticides,other,unknown
0,Alabama,AL,7000,7000,1800,26,2800,250,4,1,2015,10.0,5.4,0.0,2.2,9.1,9.4
1,Arizona,AZ,35000,35000,4600,13,3400,2100,6,1,2015,26.9,20.5,0.1,0.0,1.8,3.1
2,Arkansas,AR,13000,14000,1500,11,1200,90,1,1,2015,17.6,11.4,1.5,3.4,1.0,1.0
3,California,CA,1440000,1690000,255000,15,250000,124000,7,1,2015,24.7,7.2,3.0,7.5,6.5,2.8
4,Colorado,CO,3500,12500,1500,12,200,140,1,1,2015,14.6,0.9,1.8,0.6,2.6,5.9
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1448,West Virginia,WV,7500,8000,1100,14,0,220,3,4,2022,33.4,3.8,0.8,0.0,6.4,0.5
1449,Wisconsin,WI,26000,47000,3500,7,140,380,1,4,2022,23.2,21.4,19.4,17.5,9.9,11.7
1450,Wyoming,WY,19500,21000,3200,15,640,0,0,4,2022,22.9,5.9,4.2,0.0,0.0,7.4
1451,Other,OT,30030,30030,480,2,1190,130,0,4,2022,22.4,18.5,0.0,0.0,0.0,0.7
1452,United States,US,2888130,3595030,353910,12,170280,147950,5,4,2022,44.3,19.8,10.3,12.4,14.2,4.7

In [4]:
df.shape

(1453, 17)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1453 entries, 0 to 1452
Data columns (total 17 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   state                      1453 non-null   object
 1   state_code                 1453 non-null   object
 2   num_colonies               1453 non-null   int64
 3   max_colonies               1453 non-null   int64
 4   lost_colonies              1453 non-null   int64
 5   percent_lost               1453 non-null   int64
 6   added_colonies             1453 non-null   int64
 7   renovated_colonies         1453 non-null   int64
 8   percent_renovated          1453 non-null   int64
 9   quarter                    1453 non-null   int64
 10  year                       1453 non-null   int64
 11  varroa_mites               1453 non-null   float64
 12  other_pests_and_parasites  1453 non-null   float64
 13  diseases                   1453 non-null   float64
 14  pesticides                 1453 non-null   float64
 15  other                      1453 non-null   float64
 16  unknown                    1453 non-null   float64
dtypes: float64(6), int64(9), object(2)
memory usage: 193.1+ KB

In [6]:
df.isnull().sum()

state                        0
state_code                   0
num_colonies                 0
max_colonies                 0
lost_colonies                0
percent_lost                 0
added_colonies               0
renovated_colonies           0
percent_renovated            0
quarter                      0
year                         0
varroa_mites                 0
other_pests_and_parasites    0
diseases                     0
pesticides                   0
other                        0
unknown                      0
dtype: int64

In [7]:
df.state.unique()

array(['Alabama', 'Arizona', 'Arkansas', 'California', 'Colorado',
       'Connecticut', 'Florida', 'Georgia', 'Hawaii', 'Idaho', 'Illinois',
       'Indiana', 'Iowa', 'Kansas', 'Kentucky', 'Louisiana', 'Maine',
       'Maryland', 'Massachusetts', 'Michigan', 'Minnesota',
       'Mississippi', 'Missouri', 'Montana', 'Nebraska', 'New Jersey',
       'New Mexico', 'New York', 'North Carolina', 'North Dakota', 'Ohio',
       'Oklahoma', 'Oregon', 'Pennsylvania', 'South Carolina',
       'South Dakota', 'Tennessee', 'Texas', 'Utah', 'Vermont',
       'Virginia', 'Washington', 'West Virginia', 'Wisconsin', 'Wyoming',
       'Other', 'United States'], dtype=object)

In [8]:
# Find out the number of duplicated rows
df.duplicated().sum()

0

In [9]:
df.describe()

,num_colonies,max_colonies,lost_colonies,percent_lost,added_colonies,renovated_colonies,percent_renovated,quarter,year,varroa_mites,other_pests_and_parasites,diseases,pesticides,other,unknown
count,1.453000e+03,1.453000e+03,1453.000000,1453.000000,1453.000000,1453.000000,1453.000000,1453.000000,1453.000000,1453.000000,1453.000000,1453.000000,1453.000000,1453.000000,1453.000000
mean,1.244700e+05,1.559487e+05,16759.710943,11.266345,15744.900206,13520.302822,7.112870,2.516173,2018.474191,30.186098,10.937509,3.406676,6.185272,6.083345,3.994907
std,4.384997e+05,5.505931e+05,60681.042329,7.359984,63548.439090,57201.973644,9.025198,1.132682,2.322824,18.861293,13.035092,6.472063,8.959392,6.488208,4.939563
min,1.300000e+03,1.300000e+03,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,2015.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,8.000000e+03,9.500000e+03,950.000000,6.000000,380.000000,150.000000,1.000000,1.000000,2016.000000,15.600000,1.900000,0.100000,0.400000,1.800000,0.800000
50%,1.850000e+04,2.300000e+04,2200.000000,10.000000,1500.000000,800.000000,4.000000,3.000000,2018.000000,27.200000,7.000000,1.100000,2.600000,4.100000,2.400000
75%,5.900000e+04,7.900000e+04,7000.000000,14.000000,6000.000000,3700.000000,10.000000,4.000000,2021.000000,42.200000,15.100000,4.200000,8.500000,8.200000,5.400000
max,3.181180e+06,4.174440e+06,502350.000000,65.000000,736920.000000,762550.000000,77.000000,4.000000,2022.000000,98.800000,91.900000,87.400000,73.500000,61.400000,46.200000

Trend over time

In [12]:
grouped_year = df.groupby('year')['num_colonies'].sum().reset_index()
highest_colonies = grouped_year.sort_values(by='num_colonies', ascending=False)
highest_colonies.reset_index(drop=True, inplace=True)
print('Year with the highest colonies: ')
highest_colonies.head(7)

Year with the highest colonies:

   year  num_colonies
0  2020      24317540
1  2021      23995880
2  2022      23560840
3  2015      23363500
4  2016      23269300
5  2017      22359020
6  2018      22257720

In [13]:
grouped_year = df.groupby('year')['num_colonies'].sum().reset_index()
lowest_colonies = grouped_year.sort_values(by='num_colonies', ascending=True)
lowest_colonies.reset_index(drop=True, inplace=True)
print('Year with the lowest colonies: ')
lowest_colonies.head(7)

Year with the lowest colonies:

   year  num_colonies
0  2019      17731080
1  2018      22257720
2  2017      22359020
3  2016      23269300
4  2015      23363500
5  2022      23560840
6  2021      23995880

In [16]:
grouped_year = df.groupby('year')['added_colonies'].sum().reset_index()
highest_added_colonies = grouped_year.sort_values(by='added_colonies', ascending=False)
highest_added_colonies.reset_index(drop=True, inplace=True)
print('Year with the highest added colonies: ')
highest_added_colonies.head(7)

Year with the highest added colonies:

   year  added_colonies
0  2018         3341760
1  2020         3334220
2  2016         3301560
3  2017         3160960
4  2015         2997960
5  2021         2744120
6  2022         2529720

In [17]:
grouped_year = df.groupby('year')['added_colonies'].sum().reset_index()
lowest_added_colonies = grouped_year.sort_values(by='added_colonies', ascending=False)
lowest_added_colonies.reset_index(drop=True, inplace=True)
print('Year with the lowest added colonies: ')
lowest_added_colonies.head(7)

Year with the lowest added colonies:

   year  added_colonies
0  2018         3341760
1  2020         3334220
2  2016         3301560
3  2017         3160960
4  2015         2997960
5  2021         2744120
6  2022         2529720

In [18]:
grouped_year = df.groupby('year')['lost_colonies'].sum().reset_index()
highest_lost_colonies = grouped_year.sort_values(by='lost_colonies', ascending=False)
highest_lost_colonies.reset_index(drop=True, inplace=True)
print('Year with the highest colony loss: ')
highest_lost_colonies.head(7)

Year with the highest colony loss:

   year  lost_colonies
0  2015        3444720
1  2016        3291120
2  2018        3230300
3  2020        3225020
4  2017        3007820
5  2021        2883380
6  2022        2785680

In [19]:
grouped_year = df.groupby('year')['lost_colonies'].sum().reset_index()
lowest_lost_colonies = grouped_year.sort_values(by='lost_colonies', ascending=True)
lowest_lost_colonies.reset_index(drop=True, inplace=True)
print('Year with the highest colony loss: ')
lowest_lost_colonies.head(7)

Year with the highest colony loss:

   year  lost_colonies
0  2019        2483820
1  2022        2785680
2  2021        2883380
3  2017        3007820
4  2020        3225020
5  2018        3230300
6  2016        3291120